# Merge & Concat

In [2]:
import pandas as pd

# Merge

In [3]:
var1=pd.DataFrame({"A":[1,2],"B":[4,5]})
var2=pd.DataFrame({"A":[1,2],"c":[6,7]})
pd.merge(var1,var2,on="A")

   A  B  c
0  1  4  6
1  2  5  7

In [5]:
v1=pd.DataFrame({"A":[1,2,3],"B":[4,5,8]})
v2=pd.DataFrame({"A":[1,2,4],"c":[6,7,9]})
pd.merge(v1,v2,how="inner")

   A  B  c
0  1  4  6
1  2  5  7

In [6]:
v1=pd.DataFrame({"A":[1,2,3],"B":[4,5,8]})
v2=pd.DataFrame({"A":[1,2,4],"c":[6,7,9]})
pd.merge(v1,v2,how="outer")

   A    B    c
0  1  4.0  6.0
1  2  5.0  7.0
2  3  8.0  NaN
3  4  NaN  9.0

In [7]:
v1=pd.DataFrame({"A":[1,2,3],"B":[4,5,8]})
v2=pd.DataFrame({"A":[1,2,4],"c":[6,7,9]})
pd.merge(v1,v2,how="left")

   A  B    c
0  1  4  6.0
1  2  5  7.0
2  3  8  NaN

In [8]:
v1=pd.DataFrame({"A":[1,2,3],"B":[4,5,8]})
v2=pd.DataFrame({"A":[1,2,4],"c":[6,7,9]})
pd.merge(v1,v2,how="right")

   A    B  c
0  1  4.0  6
1  2  5.0  7
2  4  NaN  9

In [10]:
v1=pd.DataFrame({"A":[1,2,3],"B":[4,5,8]})
v2=pd.DataFrame({"A":[1,2,4],"c":[6,7,9]})
pd.merge(v1,v2,left_index=True,right_index=True)

   A_x  B  A_y  c
0    1  4    1  6
1    2  5    2  7
2    3  8    4  9

In [11]:
v1=pd.DataFrame({"A":[1,2,3],"B":[4,5,8]})
v2=pd.DataFrame({"A":[1,2,4],"B":[6,7,9]})
pd.merge(v1,v2,left_index=True,right_index=True)

   A_x  B_x  A_y  B_y
0    1    4    1    6
1    2    5    2    7
2    3    8    4    9

In [12]:
v1=pd.DataFrame({"A":[1,2,3],"B":[4,5,8]})
v2=pd.DataFrame({"A":[1,2,4],"c":[6,7,9]})
pd.merge(v1,v2,how="outer",indicator=True)

   A    B    c      _merge
0  1  4.0  6.0        both
1  2  5.0  7.0        both
2  3  8.0  NaN   left_only
3  4  NaN  9.0  right_only

In [14]:
v1=pd.DataFrame({"A":[1,2,3],"B":[4,5,8]})
v2=pd.DataFrame({"A":[1,2,4],"B":[6,7,9]})
pd.merge(v1,v2,left_index=True,right_index=True,suffixes=("name","oola"))

   Aname  Bname  Aoola  Boola
0      1      4      1      6
1      2      5      2      7
2      3      8      4      9

# Concat

In [20]:
s1=pd.Series([1,2,3])
s2=pd.Series([2,3,4])
pd.concat([s1,s2])

0    1
1    2
2    3
0    2
1    3
2    4
dtype: int64

In [21]:
d1=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})
d2=pd.DataFrame({"A":[4,5,6], "C":[5,7,8]})
pd.concat([d1,d2])

   A    B    C
0  1  4.0  NaN
1  2  5.0  NaN
2  3  6.0  NaN
0  4  NaN  5.0
1  5  NaN  7.0
2  6  NaN  8.0

In [23]:
d1=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})
d2=pd.DataFrame({"A":[10,20,30], "C":[5,7,8]})
pd.concat([d1,d2],axis=1)

   A  B   A  C
0  1  4  10  5
1  2  5  20  7
2  3  6  30  8

In [30]:
d1=pd.DataFrame({"A":[1,2,3],"B":[4,5,3]})
d2=pd.DataFrame({"A":[10,200], "C":[5,7]})
pd.concat([d1,d2],axis=1,join="outer")

   A  B      A    C
0  1  4   10.0  5.0
1  2  5  200.0  7.0
2  3  3    NaN  NaN

In [31]:
d1=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})
d2=pd.DataFrame({"A":[10,20], "C":[5,7]})
pd.concat([d1,d2],axis=1,join="inner")

   A  B   A  C
0  1  4  10  5
1  2  5  20  7

In [33]:
d1=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})
d2=pd.DataFrame({"A":[10,20,30], "C":[5,7,8]})
pd.concat([d1,d2],axis=1,keys=["l1","l2"])

  l1     l2
   A  B   A  C
0  1  4  10  5
1  2  5  20  7
2  3  6  30  8

In [34]:
d1=pd.DataFrame({"A":[1,2,3],"B":[4,5,6]})
d2=pd.DataFrame({"A":[10,20,30], "C":[5,7,8]})
pd.concat([d1,d2],axis=0,keys=["l1","l2"])

       A    B    C
l1 0   1  4.0  NaN
   1   2  5.0  NaN
   2   3  6.0  NaN
l2 0  10  NaN  5.0
   1  20  NaN  7.0
   2  30  NaN  8.0